http/results/retro2-effects-uring-R5000-r2.txt
Running 20s test @ http://127.0.0.1:19210/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.408ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.459ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.435ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.456ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.69ms    1.00ms   8.83ms   77.78%
    Req/Sec     1.31k   628.68     2.78k    76.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.49ms
 75.000%    2.09ms
 90.000%    2.90ms
 99.000%    5.37ms
 99.900%    7.55ms
 99.990%    8.34ms
 99.999%    8.84ms
100.000%    8.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.132     0.000000            1         1.00
       0.696     0.100000         4953         1.11
       0.912     0.200000         9874         1.25
       1.117     0.300000        14828         1.43
       1.299     0.400000        19750         1.67
       1.490     0.500000        24685         2.00
       1.590     0.550000        27168         2.22
       1.691     0.600000        29618         2.50
       1.805     0.650000        32080         2.86
       1.935     0.700000        34551         3.33
       2.091     0.750000        37037         4.00
       2.173     0.775000        38273         4.44
       2.271     0.800000        39497         5.00
       2.379     0.825000        40719         5.71
       2.513     0.850000        41954         6.67
       2.679     0.875000        43183         8.00
       2.787     0.887500        43808         8.89
       2.905     0.900000        44420        10.00
       3.043     0.912500        45035        11.43
       3.195     0.925000        45649        13.33
       3.375     0.937500        46269        16.00
       3.485     0.943750        46579        17.78
       3.601     0.950000        46883        20.00
       3.727     0.956250        47193        22.86
       3.885     0.962500        47500        26.67
       4.079     0.968750        47809        32.00
       4.183     0.971875        47967        35.56
       4.299     0.975000        48118        40.00
       4.443     0.978125        48272        45.71
       4.643     0.981250        48426        53.33
       4.883     0.984375        48582        64.00
       4.999     0.985938        48660        71.11
       5.099     0.987500        48735        80.00
       5.263     0.989062        48813        91.43
       5.467     0.990625        48888       106.67
       5.699     0.992188        48968       128.00
       5.811     0.992969        49004       142.22
       5.991     0.993750        49043       160.00
       6.139     0.994531        49084       182.86
       6.243     0.995313        49120       213.33
       6.387     0.996094        49159       256.00
       6.495     0.996484        49177       284.44
       6.583     0.996875        49197       320.00
       6.699     0.997266        49216       365.71
       6.887     0.997656        49235       426.67
       7.051     0.998047        49254       512.00
       7.115     0.998242        49264       568.89
       7.191     0.998437        49273       640.00
       7.347     0.998633        49283       731.43
       7.459     0.998828        49293       853.33
       7.559     0.999023        49302      1024.00
       7.623     0.999121        49307      1137.78
       7.683     0.999219        49312      1280.00
       7.779     0.999316        49317      1462.86
       7.863     0.999414        49322      1706.67
       7.903     0.999512        49327      2048.00
       7.911     0.999561        49329      2275.56
       7.939     0.999609        49331      2560.00
       8.039     0.999658        49334      2925.71
       8.087     0.999707        49336      3413.33
       8.123     0.999756        49338      4096.00
       8.167     0.999780        49340      4551.11
       8.223     0.999805        49341      5120.00
       8.239     0.999829        49342      5851.43
       8.247     0.999854        49343      6826.67
       8.295     0.999878        49344      8192.00
       8.335     0.999890        49345      9102.22
       8.375     0.999902        49346     10240.00
       8.375     0.999915        49346     11702.86
       8.415     0.999927        49347     13653.33
       8.415     0.999939        49347     16384.00
       8.471     0.999945        49349     18204.44
       8.471     0.999951        49349     20480.00
       8.471     0.999957        49349     23405.71
       8.471     0.999963        49349     27306.67
       8.471     0.999969        49349     32768.00
       8.471     0.999973        49349     36408.89
       8.471     0.999976        49349     40960.00
       8.471     0.999979        49349     46811.43
       8.839     0.999982        49350     54613.33
       8.839     1.000000        49350          inf
#[Mean    =        1.692, StdDeviation   =        0.999]
#[Max     =        8.832, Total count    =        49350]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  98571 requests in 20.00s, 199.10MB read
Requests/sec:   4927.78
Transfer/sec:      9.95MB

JSON Output:
{
	"requests": 98571,
	"duration_in_microseconds": 20003126.00,
	"bytes": 208773378,
	"requests_per_sec": 4927.78,
	"bytes_transfer_per_sec": 10437037.59,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1490
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2091
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 2905
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 5371
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 7555
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 8335
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 8839
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 8839
		}
	]
}